[
  {
    "name": "Maria the Widow",
    "story_parts": [
      "Maria lost her husband to the winter sea. She runs his vineyard alone now, but creditors close in.",
      "The vines hang heavy in the autumn air, waiting for hands that may never come.",
      "A letter from the creditors sits unopened on the table, its seal like a wound.",
      "The harvest moon rises over the vineyard. Maria has made her choice."
    ]
  },
  {
    "name": "Father Corvus",
    "story_parts": [
      "A priest who hears confessions by day and gambles by night. His debts have grown larger than his parish.",
      "The collection plate grows lighter each Sunday, and the shadows under his eyes grow darker.",
      "A letter from the bishop arrives, sealed in crimson wax.",
      "The church bells toll one final time under his watch."
    ]
  },
  {
    "name": "Isolde the Alchemist",
    "story_parts": [
      "She claims to have discovered the formula for liquid sunlight, but the last three who tested it went blind. A wealthy patron demands a demonstration tomorrow.",
      "The patron's carriage is already visible on the road, drawing closer with every hour.",
      "The vial gleams on the workbench, beautiful and terrible in equal measure.",
      "Isolde raises the vial to the light one final time and makes her decision."
    ]
  },
  {
    "name": "Old Tomas",
    "story_parts": [
      "A retired soldier haunted by a promise he made to a dying comrade thirty years ago. He finally has the means to fulfill it.",
      "He has gathered enough coin at last, but his hands shake when he counts it.",
      "The road north stretches before him, longer than his remaining strength.",
      "Tomas takes his first step. The promise will be kept, or it will not."
    ]
  },
  {
    "name": "Lyra Songweaver",
    "story_parts": [
      "A famous bard whose voice is fading with age. She has been offered a dark bargain: her voice restored in exchange for the memories that inspired her greatest songs.",
      "The stranger's offer echoes in her mind — her voice returned, her memories forfeit.",
      "She opens her mouth to sing, but only silence answers.",
      "The last note fades into the dark. Lyra closes her eyes and decides."
    ]
  },
  {
    "name": "The Twins, Ash and Ember",
    "story_parts": [
      "Siblings who inherited a crumbling estate. One wants to restore it, the other wants to burn it down and start fresh.",
      "They stand in the great hall together, rainwater dripping through the collapsed roof.",
      "Ash reaches for the foundation stone. Ember reaches for the torch.",
      "The estate holds its breath, waiting to see which twin prevails."
    ]
  },
  {
    "name": "Captain Maren",
    "story_parts": [
      "A smuggler who found a sealed chest at the bottom of a wreck. Every locksmith who tried to open it has fled in terror.",
      "The chest sits in her cabin, cold to the touch even in summer heat.",
      "She runs her fingers along the seal, feeling it pulse like a second heartbeat.",
      "The lock clicks. Captain Maren lifts the lid."
    ]
  },
  {
    "name": "Grandmother Silk",
    "story_parts": [
      "The oldest weaver in the city has begun stitching patterns in her sleep that match no known design. Her apprentices are afraid.",
      "They whisper in corners, refusing to touch the growing tapestry.",
      "The pattern shifts again overnight, revealing shapes that should not exist in thread.",
      "Grandmother Silk sits at her loom for what she knows will be the last time."
    ]
  },
  {
    "name": "Darius the Exiled",
    "story_parts": [
      "Once a royal advisor, now a beggar at the city gates. He chose exile over complicity in a terrible act.",
      "The new king is dead, and messengers in dark cloaks are searching for him.",
      "A royal seal is pressed into his palm by a hooded figure in the crowd.",
      "Darius stands at the gates, facing the long road back to the throne."
    ]
  },
  {
    "name": "Little Wren",
    "story_parts": [
      "A child of no more than ten, clutching a handful of copper coins. Her mother has been asleep for three days and will not wake.",
      "The coins feel warm in her small hands, like the last of her mother's warmth.",
      "She has walked very far to find someone who might know what to do.",
      "Little Wren pockets her coins and turns toward home."
    ]
  },
  {
    "name": "Magistrate Voss",
    "story_parts": [
      "A judge renowned for fairness who must now sentence his own son for theft. The evidence is damning.",
      "But something in the testimony does not ring true. A name keeps appearing in the margins of the case file, always scratched out.",
      "The courtroom gallery is packed. Every eye is on the magistrate's hands.",
      "Magistrate Voss lifts his gavel. The courtroom falls silent."
    ]
  },
  {
    "name": "Zahara of the Dunes",
    "story_parts": [
      "A desert trader who crossed paths with a caravan of ghosts on the salt flats. They offered her a map to a buried city.",
      "She survived the encounter, but cannot forget the route. It burns behind her eyes when she sleeps.",
      "The map sears in her saddlebag, hotter each night, pulling her south toward the dunes.",
      "Zahara turns her mount into the shimmering heat and rides."
    ]
  }
]
